In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
id_no = ["P001", "P002", "P003", "P004", "P005", "P006", "P007", "P008", "P009", "P010", "P011"]
gender = ["M", "F", "M", "F", "M", "F", "M", "F", "M", "F", "M"]
status = ["FT", "PT", "-", "FT", "PT", "PT", "FT", "-", "PT", "FT", np.nan]
dept = ["DS", "FS", "AWS", "AWS", "DS", np.nan, "FS", "FS", np.nan, "DS","AWS"]
dept_ = [1, "FS", None, "AWS", 5.2, np.nan, "FS", "FS", np.nan, "DS", "AWS"]
V1 = np.array([2, 3, 5, np.nan, 7, 1, np.nan, 10, 14, "-", 6])
V2 = np.array([8, np.nan, 5, 8, 11, np.nan, np.nan, 2, 3, 7, 9])
salary = np.array([np.nan, 54, 59, 120, 58, 75, np.nan, 136, 60, 125, np.nan])
df = pd.DataFrame({"id": id_no,
                   "gender": gender,
                   "status": status,
                   "dept": dept,
                   "dept_": dept_,
                   "var1": V1,
                   "var2": V2,
                   "salary": salary})
df

      id gender status dept dept_ var1  var2  salary
0   P001      M     FT   DS     1    2   8.0     NaN
1   P002      F     PT   FS    FS    3   NaN    54.0
2   P003      M      -  AWS  None    5   5.0    59.0
3   P004      F     FT  AWS   AWS  nan   8.0   120.0
4   P005      M     PT   DS   5.2    7  11.0    58.0
5   P006      F     PT  NaN   NaN    1   NaN    75.0
6   P007      M     FT   FS    FS  nan   NaN     NaN
7   P008      F      -   FS    FS   10   2.0   136.0
8   P009      M     PT  NaN   NaN   14   3.0    60.0
9   P010      F     FT   DS    DS    -   7.0   125.0
10  P011      M    NaN  AWS   AWS    6   9.0     NaN

In [3]:
# NaN Not a number

In [6]:
df['dept_'].value_counts(dropna= False)

FS     3
NaN    3
AWS    2
1      1
5.2    1
DS     1
Name: dept_, dtype: int64

In [7]:
df['dept_'].value_counts(dropna= True)

FS     3
AWS    2
1      1
5.2    1
DS     1
Name: dept_, dtype: int64

In [8]:
df['dept_'].value_counts()

FS     3
AWS    2
1      1
5.2    1
DS     1
Name: dept_, dtype: int64

In [10]:
dept_

[1, 'FS', None, 'AWS', 5.2, nan, 'FS', 'FS', nan, 'DS', 'AWS']

In [9]:
df["dept_"].isnull().sum()

3

In [11]:
df["dept_"].isna().sum()

3

In [18]:
V1

array(['2', '3', '5', 'nan', '7', '1', 'nan', '10', '14', '-', '6'],
      dtype='<U32')

In [14]:
V1, type(V1[1]), type(V1[3]), type(V1[6]) ,type(V1)

(array(['2', '3', '5', 'nan', '7', '1', 'nan', '10', '14', '-', '6'],
       dtype='<U32'),
 numpy.str_,
 numpy.str_,
 numpy.str_,
 numpy.ndarray)

In [16]:
df['var1'].value_counts(dropna=False)

nan    2
2      1
3      1
5      1
7      1
1      1
10     1
14     1
-      1
6      1
Name: var1, dtype: int64

In [17]:
df["var1"].value_counts()

nan    2
2      1
3      1
5      1
7      1
1      1
10     1
14     1
-      1
6      1
Name: var1, dtype: int64

In [19]:
df["var1"].isnull().sum()

0

In [20]:
V2, type(V2[1]), type(V2[3]), type(V2[6])

(array([ 8., nan,  5.,  8., 11., nan, nan,  2.,  3.,  7.,  9.]),
 numpy.float64,
 numpy.float64,
 numpy.float64)

In [21]:
df["var2"].value_counts(dropna=False)

NaN     3
8.0     2
5.0     1
11.0    1
2.0     1
3.0     1
7.0     1
9.0     1
Name: var2, dtype: int64

In [22]:
df["var2"].value_counts()

8.0     2
5.0     1
11.0    1
2.0     1
3.0     1
7.0     1
9.0     1
Name: var2, dtype: int64

In [23]:
df['var2'].isnull().sum()

3

In [24]:
salary, type(salary[1]), type(salary[3]), type(salary[6])

(array([ nan,  54.,  59., 120.,  58.,  75.,  nan, 136.,  60., 125.,  nan]),
 numpy.float64,
 numpy.float64,
 numpy.float64)

In [27]:
df['salary'].value_counts(dropna =False)

NaN      3
54.0     1
59.0     1
120.0    1
58.0     1
75.0     1
136.0    1
60.0     1
125.0    1
Name: salary, dtype: int64

In [28]:
df["salary"].value_counts()

54.0     1
59.0     1
120.0    1
58.0     1
75.0     1
136.0    1
60.0     1
125.0    1
Name: salary, dtype: int64

In [29]:
df.salary.isnull().sum()

3

#### Object Type

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      11 non-null     object
 1   gender  11 non-null     object
 2   status  10 non-null     object
 3   dept    9 non-null      object
 4   dept_   8 non-null      object
 5   var1    11 non-null     object
 6   var2    8 non-null      float64
 7   salary  8 non-null      float64
dtypes: float64(2), object(6)
memory usage: 832.0+ bytes

In [34]:
df['dept_']

0        1
1       FS
2     None
3      AWS
4      5.2
5      NaN
6       FS
7       FS
8      NaN
9       DS
10     AWS
Name: dept_, dtype: object

In [35]:
type(df["dept_"][0]), type(df["dept_"][1]), type(df["dept_"][2]), type(df["dept_"][3]), type(df["dept_"][5])

(int, str, NoneType, str, float)

In [36]:
df['var1']

0       2
1       3
2       5
3     nan
4       7
5       1
6     nan
7      10
8      14
9       -
10      6
Name: var1, dtype: object

In [37]:
type(df["var1"][0]), type(df["var1"][3]), type(df["var1"][9])

(str, str, str)

In [38]:
df["var2"]

0      8.0
1      NaN
2      5.0
3      8.0
4     11.0
5      NaN
6      NaN
7      2.0
8      3.0
9      7.0
10     9.0
Name: var2, dtype: float64

In [39]:
type(df["var2"][0]), type(df["var2"][1]), type(df["var2"][3])

(numpy.float64, numpy.float64, numpy.float64)

In [40]:
df["salary"]

0       NaN
1      54.0
2      59.0
3     120.0
4      58.0
5      75.0
6       NaN
7     136.0
8      60.0
9     125.0
10      NaN
Name: salary, dtype: float64

In [41]:
type(df["salary"][0]), type(df["salary"][1]), type(df["salary"][3])

(numpy.float64, numpy.float64, numpy.float64)

In [42]:
df = df.drop("dept_", axis=1)
df

      id gender status dept var1  var2  salary
0   P001      M     FT   DS    2   8.0     NaN
1   P002      F     PT   FS    3   NaN    54.0
2   P003      M      -  AWS    5   5.0    59.0
3   P004      F     FT  AWS  nan   8.0   120.0
4   P005      M     PT   DS    7  11.0    58.0
5   P006      F     PT  NaN    1   NaN    75.0
6   P007      M     FT   FS  nan   NaN     NaN
7   P008      F      -   FS   10   2.0   136.0
8   P009      M     PT  NaN   14   3.0    60.0
9   P010      F     FT   DS    -   7.0   125.0
10  P011      M    NaN  AWS    6   9.0     NaN

#### type of NaN Werten

In [46]:
df.select_dtypes(include=float)

    var2  salary
0    8.0     NaN
1    NaN    54.0
2    5.0    59.0
3    8.0   120.0
4   11.0    58.0
5    NaN    75.0
6    NaN     NaN
7    2.0   136.0
8    3.0    60.0
9    7.0   125.0
10   9.0     NaN

In [48]:
df.select_dtypes(include=int)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [47]:
df.select_dtypes(include=object)

      id gender status dept var1
0   P001      M     FT   DS    2
1   P002      F     PT   FS    3
2   P003      M      -  AWS    5
3   P004      F     FT  AWS  nan
4   P005      M     PT   DS    7
5   P006      F     PT  NaN    1
6   P007      M     FT   FS  nan
7   P008      F      -   FS   10
8   P009      M     PT  NaN   14
9   P010      F     FT   DS    -
10  P011      M    NaN  AWS    6

In [49]:
df.select_dtypes(include=object).T

          0     1     2     3     4     5     6     7     8     9     10
id      P001  P002  P003  P004  P005  P006  P007  P008  P009  P010  P011
gender     M     F     M     F     M     F     M     F     M     F     M
status    FT    PT     -    FT    PT    PT    FT     -    PT    FT   NaN
dept      DS    FS   AWS   AWS    DS   NaN    FS    FS   NaN    DS   AWS
var1       2     3     5   nan     7     1   nan    10    14     -     6

In [53]:
# df.describe(include='all').T
df.describe(include='all').transpose()

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
id,11,11,P001,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
gender,11,2,M,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN
status,10,3,FT,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
dept,9,3,DS,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
var1,11,10,nan,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
var2,8.0,NaN,NaN,NaN,6.625,3.067689,2.0,4.5,7.5,8.25,11.0
salary,8.0,NaN,NaN,NaN,85.875,34.868887,54.0,58.75,67.5,121.25,136.0

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      11 non-null     object
 1   gender  11 non-null     object
 2   status  10 non-null     object
 3   dept    9 non-null      object
 4   var1    11 non-null     object
 5   var2    8 non-null      float64
 6   salary  8 non-null      float64
dtypes: float64(2), object(5)
memory usage: 744.0+ bytes

In [55]:
type(np.nan)

float

In [56]:
type(np.NaN)

float

In [57]:
type(None)

NoneType

In [58]:
df

      id gender status dept var1  var2  salary
0   P001      M     FT   DS    2   8.0     NaN
1   P002      F     PT   FS    3   NaN    54.0
2   P003      M      -  AWS    5   5.0    59.0
3   P004      F     FT  AWS  nan   8.0   120.0
4   P005      M     PT   DS    7  11.0    58.0
5   P006      F     PT  NaN    1   NaN    75.0
6   P007      M     FT   FS  nan   NaN     NaN
7   P008      F      -   FS   10   2.0   136.0
8   P009      M     PT  NaN   14   3.0    60.0
9   P010      F     FT   DS    -   7.0   125.0
10  P011      M    NaN  AWS    6   9.0     NaN

In [60]:
df.isnull()
# df.isna() # alias name

       id  gender  status   dept   var1   var2  salary
0   False   False   False  False  False  False    True
1   False   False   False  False  False   True   False
2   False   False   False  False  False  False   False
3   False   False   False  False  False  False   False
4   False   False   False  False  False  False   False
5   False   False   False   True  False   True   False
6   False   False   False  False  False   True    True
7   False   False   False  False  False  False   False
8   False   False   False   True  False  False   False
9   False   False   False  False  False  False   False
10  False   False    True  False  False  False    True

In [62]:
df.notnull()
# df.notna()

      id  gender  status   dept  var1   var2  salary
0   True    True    True   True  True   True   False
1   True    True    True   True  True  False    True
2   True    True    True   True  True   True    True
3   True    True    True   True  True   True    True
4   True    True    True   True  True   True    True
5   True    True    True  False  True  False    True
6   True    True    True   True  True  False   False
7   True    True    True   True  True   True    True
8   True    True    True  False  True   True    True
9   True    True    True   True  True   True    True
10  True    True   False   True  True   True   False

In [63]:
# Spalten/Variablen mit fehlenden Werten:
df.isnull().any()

id        False
gender    False
status     True
dept       True
var1      False
var2       True
salary     True
dtype: bool

In [64]:
# Zeilen mit fehlenden Werten:
df.isnull().any(axis=1)

0      True
1      True
2     False
3     False
4     False
5      True
6      True
7     False
8      True
9     False
10     True
dtype: bool

In [65]:
df[df.isnull().any(axis=1)]

      id gender status dept var1  var2  salary
0   P001      M     FT   DS    2   8.0     NaN
1   P002      F     PT   FS    3   NaN    54.0
5   P006      F     PT  NaN    1   NaN    75.0
6   P007      M     FT   FS  nan   NaN     NaN
8   P009      M     PT  NaN   14   3.0    60.0
10  P011      M    NaN  AWS    6   9.0     NaN

In [71]:
# Zeilen mit allen notnull-Werten mit '~'
df[~df.isnull().any(axis = 1)]

     id gender status dept var1  var2  salary
2  P003      M      -  AWS    5   5.0    59.0
3  P004      F     FT  AWS  nan   8.0   120.0
4  P005      M     PT   DS    7  11.0    58.0
7  P008      F      -   FS   10   2.0   136.0
9  P010      F     FT   DS    -   7.0   125.0

In [70]:
df[df.notnull().any(axis=1)]

      id gender status dept var1  var2  salary
0   P001      M     FT   DS    2   8.0     NaN
1   P002      F     PT   FS    3   NaN    54.0
2   P003      M      -  AWS    5   5.0    59.0
3   P004      F     FT  AWS  nan   8.0   120.0
4   P005      M     PT   DS    7  11.0    58.0
5   P006      F     PT  NaN    1   NaN    75.0
6   P007      M     FT   FS  nan   NaN     NaN
7   P008      F      -   FS   10   2.0   136.0
8   P009      M     PT  NaN   14   3.0    60.0
9   P010      F     FT   DS    -   7.0   125.0
10  P011      M    NaN  AWS    6   9.0     NaN

In [72]:
df[df.notnull().all(axis = 1)]

     id gender status dept var1  var2  salary
2  P003      M      -  AWS    5   5.0    59.0
3  P004      F     FT  AWS  nan   8.0   120.0
4  P005      M     PT   DS    7  11.0    58.0
7  P008      F      -   FS   10   2.0   136.0
9  P010      F     FT   DS    -   7.0   125.0

In [73]:
df.isnull().all()

id        False
gender    False
status    False
dept      False
var1      False
var2      False
salary    False
dtype: bool

In [74]:
# Zeilen, deren alle Werte sind Null:
df.isnull().all(axis=1)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [75]:
df[df.isnull().all(axis=1)]

Empty DataFrame
Columns: [id, gender, status, dept, var1, var2, salary]
Index: []

In [76]:
df.isnull().sum()

id        0
gender    0
status    1
dept      2
var1      0
var2      3
salary    3
dtype: int64

In [77]:
df.isnull().sum().sum()

9

In [78]:
df.salary.isnull()

0      True
1     False
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9     False
10     True
Name: salary, dtype: bool

In [79]:
df.salary.isnull().sum()

3

In [80]:
df.salary.isnull().any()

True

In [81]:
# Prozentsatz von Nullwerten nach Spalten
round(df.isnull().sum()/len(df)*100, 2)

id         0.00
gender     0.00
status     9.09
dept      18.18
var1       0.00
var2      27.27
salary    27.27
dtype: float64

In [83]:
df.isnull().sum()/ len(df)*100

id         0.000000
gender     0.000000
status     9.090909
dept      18.181818
var1       0.000000
var2      27.272727
salary    27.272727
dtype: float64

## Konvertieren unangemessener Werte in NaN-Werte
#### Uygunsuz degerleri NaN a dönüstür
- map()
- replace()

In [85]:
df

      id gender status dept var1  var2  salary
0   P001      M     FT   DS    2   8.0     NaN
1   P002      F     PT   FS    3   NaN    54.0
2   P003      M      -  AWS    5   5.0    59.0
3   P004      F     FT  AWS  nan   8.0   120.0
4   P005      M     PT   DS    7  11.0    58.0
5   P006      F     PT  NaN    1   NaN    75.0
6   P007      M     FT   FS  nan   NaN     NaN
7   P008      F      -   FS   10   2.0   136.0
8   P009      M     PT  NaN   14   3.0    60.0
9   P010      F     FT   DS    -   7.0   125.0
10  P011      M    NaN  AWS    6   9.0     NaN

In [86]:
df['var1'].map({'-': np.nan }) # bulursa hepsini degistiriyor

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
10   NaN
Name: var1, dtype: float64

In [87]:
df['var1'].replace({'-': np.nan }) # bulursa sadece ilgili kisimlari  degistiriyor

0       2
1       3
2       5
3     nan
4       7
5       1
6     nan
7      10
8      14
9     NaN
10      6
Name: var1, dtype: object